// створити по одному циклу проходу від 0 до 9, на кожній ітерації якого виводитиметься значення поточного ітератора.
// Потім по одному циклу від 100 до 0 з кроком 10, де виводитиметься ітератор на кожній ітерації.

console.log('-------------for  від 0 до 9 --------------');

for (let i = 0; i <= 9; i++) {
    console.log(i);
}

console.log('-------------for від 100 до 0 з кроком 10----------------');

for (let j = 100; j > 0; j = j - 10) {
    console.log(j);
}

console.log('------------while від 100 до 0 з кроком 10-------------');

let x = 100;
while (x > 0) {
    console.log(x);
    x = x - 10;
}

console.log('------------do while від 100 до 0 з кроком 10-------------');

let y = 100;
do {console.log(y);
    y = y - 10;
}
while (y > 0);
